<?php
/**
 * 增加对不同类型的HTTP状态码的返回.
 *
 * 错误码,HTTP状态码,返回值
 */
return [
// ---------- START 主要返回状态码如下 200、400、401、403、404、500
    '200' => [
        'http_code' => 200,
        'remark' => '请求成功',
    ],
    '400' => [
        'http_code' => 400,
        'remark' => '参数错误',
    ],
    '401' => [
        'http_code' => 401,
        'remark' => '未授权（令牌、用户名、密码错误）',
    ],
    '403' => [
        'http_code' => 403,
        'remark' => '禁止访问',
    ],
    '404' => [
        'http_code' => 404,
        'remark' => '请求内容不存在',
    ],
    '499' => [
        'http_code' => 499,
        'remark' => 'token过期或无效 请重新登录',
    ],
    '500' => [
        'http_code' => 500,
        'remark' => '系统内部错误',
    ],
// ---------- END ----------

    '201' => [
        'http_code' => 201,
        'remark' => '响应 POST 请求时成功创建一个资源。',
    ],
    '301' => [
        'http_code' => 301,
        'remark' => '资源已被移除',
    ],
    '303' => [
        'http_code' => 303,
        'remark' => '重定向',
    ],
    '304' => [
        'http_code' => 304,
        'remark' => '资源没有被修改',
    ],
    '402' => [
        'http_code' => 402,
        'remark' => '服务器拒绝请求方式',
    ],
    '405' => [
        'http_code' => 405,
        'remark' => '数据已存在',
    ],
    '406' => [
        'http_code' => 406,
        'remark' => '文件不存在',
    ],
];
