/*
*	全国三级城市联动 js版
*/
function Dsy(){
    this.Items = {};
}
Dsy.prototype.add = function(id,iArray){
    this.Items[id] = iArray;
}
Dsy.prototype.Exists = function(id){
    if(typeof(this.Items[id]) == "undefined") return false;
    return true;
}

function change(v){
    var str="0";
    for(i=0;i<v;i++){
        str+=("_"+(document.getElementById(s[i]).selectedIndex-1));
    };
    var ss=document.getElementById(s[v]);
    with(ss){
        length = 0;
        options[0]=new Option(opt0[v],opt0[v]);
        if(v && document.getElementById(s[v-1]).selectedIndex>0 || !v){
            if(dsy.Exists(str)){
                ar = dsy.Items[str];
                for(i=0;i<ar.length;i++){
                    options[length]=new Option(ar[i],ar[i]);
                }//end for
                if(v){ options[0].selected = true; }
            }
        }//end if v
        if(++v<s.length){change(v);}
    }//End with
}

var dsy = new Dsy();
dsy.add("0",["أبوظبي","دبي","الشارقة","رأس الخيمة","أم القيوان","عجمان","الفجيرة"]);


dsy.add("0_0",["أبوظبي"	,"العين","الشهامة","الطولة","الشليلة","الشامخة","مدينة بني ياس",	"الوثبة","سويحان","ميناء خليفة","ميناء زايد"]);


dsy.add("0_1",["أبو هيل"	,"نادي العوير الأولى",	"نادي العوير الثانية",	"آل بادا",	"البراحة",	"البرشاء الأولى",	"البرشاء الثانية",	"البرشاء جنوب الاولى"	,"البرشاء جنوب الثانية",	"البرشاء جنوب الثالثة",	"البرشاء الثالثة"	,"البطين",	"الضغاية"	,"القرهود",	"القاعدة الرابعة غووز",	"دبي الحمرية"	,"ميناء الحمرية",	"الحضيبة",	"الجداف",	"ال الجافلية",	"الكرامة",	"الخبيصي",	"الخوانيج الأولي",	"الخوانيج الثانية",	"الكفاف",	"الممزر",	"المنارة",	"آل مرقد",	"المينا",	"المزهر الأولى",	"المزهر الثانية",	"المرقبات",	"المرر",	"حي السبخة",	"المطينة",	"النهدة الأولى",	"النهدة الثانية",	"القوز الأولى",	"منطقة القوز الصناعية الأولى",	"منطقة القوز الصناعية الرابعة",	"منطقة القوز الصناعية الثانية",	"منطقة القوز الصناعية الثالثة",	"القوز الثانية",	"القوز الثالثة",	"القصيص الأولى",	"القصيص الصناعية الخامسة",	"القصيص الصناعية الأولى",	"القصيص الصناعية الرابعة",	"القصيص الصناعية الثانية",	"القصيص الصناعية الثالثة",	"القصيص الثانية",	"القصيص الثالثة",	"الرفاع",	"الراس"	,"الراشدية"	,"الرقة"	,"الصفا الأولي"	,"الصفا الثانية"	,"الصفوح الأولي"	,"الصفوح الثانية"	,"السطوة"	,"الشندغة",	"سوق الكبير"	,"الطوار الأولى",	"الطوار الثانية",	"الطوار الثالثة",	"الورقاء الخامسة"	,"الورقاء الأولى"	,"الورقاء الرابعة"	,"الورقاء الثانية",	"الورقاء الثالثة",	"الوصل"	,"الوحيدة, دبي"	,"عيال ناصر"	,"العياص"	,"بو كدره"	,"مجمع دبي للاستثمار أول"	,"مجمع دبي للاستثمار الثاني"	,"تلال الإمارات الأولى"	,"تلال الإمارات الثانية",	"تلال الامارات الثالثة"	,"حتا"	,"هور العنز"	,"هور العنز شرق"	,"جبل علي 1"	,"جبل علي 2"	,"جبل علي الصناعية"	,"نخلة جبل علي"	,"جميرا الأولي"	,"نخلة جميرا"	,"جميرا الثانية"	,"الجميرا الثالثة"	,"المنخول"	,"مرسى دبي",	"مردف"	,"محيصنة الرابعة",	"محيصنة الثانية",	"محيصنة الثالثة"	,"محيصنة الأولي"	,"المشرف"	,"ند الحمر",	"ناد الشبا رابعة",	"ناد الشبا ثانيا",	"ناد الشبا الثالث",	"ناد شما",	"نايف",	"المطينة الأولي",	"المطينة الثانية",	"النصر، دبي"	,"بور سعيد"	,"المرابع العربية"	,"رأس الخور"	,"رأس الخور الصناعية الأولي"	,"رأس الخور الصناعية الثانية"	,"رأس الخور الصناعية الثالثة"	,"رقة البطين"	,"مركز التجارة 1"	,"مركز التجارة 2"	,"أم الشيف"	,"أم هرير الأولي"	,"أم هرير الثانية",	"أم رمول",	"أم سقيم الأولى",	"أم سقيم الثانية",	"أم سقيم الثالثة",	"وادي العماردي",	"ورسان الاولى"	,"ورسان الثانية",	"زعبيل الأولى"	,"زعبيل الثانية"
]);


dsy.add("0_2",["الشارقة"	,"كلباء",	"دبا الحصن",	"خور فكان"]);



dsy.add("0_3",["رأس الخيمة"	,"الجزيرة الحمراء"	,"عرب رامس",	"خور خوير",	"دقداقة"	,"خت",	"مسافي"]);


dsy.add("0_4",["أم القيوان"]);



dsy.add("0_5",["عجمان"]);


dsy.add("0_6",["الفجيرة"]);


dsy.add("0",["أبوظبي","دبي","الشارقة","رأس الخيمة","أم القيوان","عجمان","الفجيرة"]);

var s=["s_province","s_city"];//三个select的name
var opt0 = ["المدينة", "المنطقة"];//初始值
function _init_area(){  //初始化函数
    for(i=0;i<s.length-1;i++){
        document.getElementById(s[i]).onchange=new Function("change("+(i+1)+")");
    }
    change(0);
}
